Revit 2026 API

# PointCloudFilterFactory Methods

---

The PointCloudFilterFactory type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateMultiPlaneFilter(IListPlane) |  |
|  | CreateMultiPlaneFilter(IListPlane, Int32) |  |

#### Reference

PointCloudFilterFactory Class

Autodesk.Revit.DB.PointClouds Namespace